Repository: 84000/data-translation-memory
Catalog: toh182-v2.tmx
Source language: bo
Languages: en

source: བདག་གིས་ཡོ་བྱད་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: Therefore, I will definitely practice generosity by offering provisions!’

source: དེ་ཡོ་བྱད་ཀྱི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering provisions,

source: དེ་བཞིན་གཤེགས་པ་ལ་འོས་པའི་སྨོན་ལམ་བཞིན་དུ་ཡོ་བྱད་བྱིན་པ་འདིས་ན་བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་ཀྱི་ཡོ་བྱད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་གྱུར་ཅིག་
en: ‘In accordance with aspirations worthy of the thus-gone ones, through this offering of provisions may I cause all beings to complete the provisions for awakening!’

source: ཡོ་བྱད་ཡོངས་སུ་བཏང་བ་དེས། །བདག་གིས་ཀྱང་ནི་ལུས་ཅན་གྱི། །བྱང་ཆུབ་ཡོ་བྱད་བཙལ་བ་དག །ཡོངས་སུ་རྫོགས་པར་བྱེད་གྱུར་ཅིག །
en: “Through this gift of provisions, May I cause beings who seek The provisions for awakening To achieve complete fulfillment!

source: ཡོ་བྱད་རབ་ཏུ་བྱིན་པ་ཡིས། །གང་དང་གང་དུ་སྐྱེས་པ་དེར། །རྣམ་པ་ཀུན་གྱི་མཆོག་ལྡན་པའི། །ཡན་ལག་ཐམས་ཅད་རྫོགས་པར་འགྱུར། །
en: “By offering provisions Wherever one is born, One will enjoy excellent limbs That are perfect in all regards.

source: དེ་ལ་སྨན་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering medicine?

source: སྨན་གྱི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྒ་བ་དང་འཆི་བ་མེད་པའི་བདུད་རྩིའི་བདེ་བ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Offering medicine represents the perfect well-being of the ambrosia by which all beings are freed from old age and death. Therefore,

source: བདག་གིས་སྨན་གྱི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by offering medicine!’

source: དེ་སྨན་གྱི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering medicine,

source: དེ་བཞིན་གཤེགས་པས་བྱིན་གྱིས་བརླབས་པའི་སྨོན་ལམ་བཞིན་དུ། སྨན་བྱིན་པ་འདིས་ན་བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྒ་བ་དང་། འཆི་བ་མེད་པའི་བདུད་རྩིའི་བདེ་བ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་གྱུར་ཅིག་
en: ‘In accordance with the aspirations blessed by the thus-gone ones, through this offering of medicine may I cause all beings to perfect the well-being of the ambrosia by which which all beings are freed from old age and death!’

source: རྩི་དང་སྨན་གྱི་སྦྱིན་པ་ཡིས། །སེམས་ཅན་ཐམས་ཅད་ཚེ་དཔག་མེད། །ཐམས་ཅད་མཁྱེན་པའི་བདུད་རྩི་ཡང་། །མྱུར་བ་ཉིད་དུ་ཐོབ་གྱུར་ཅིག །
en: “Through this offering of elixir and medicine, May all beings attain boundless life, And may they quickly attain The nectar of omniscience.

source: རྩི་དང་སྨན་གྱི་སྦྱིན་པ་ཡིས། །ཟླ་བ་ཉ་ལྟར་ནད་མེད་ཅིང་། །གནོད་ཆུང་སྐྱིད་ཅིང་བདེ་བར་གནས། །མི་རྣམས་ཚེ་ནི་རིང་བར་འགྱུར། །
en: “By offering elixir and medicine, One will be healthy like the full moon. One will enjoy well-being, happiness, Longevity, and little harm.

source: དེ་ལ་བྲན་དང་བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by relinquishing male and female slaves, staff, and workers?

source: བྲན་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རང་དགའ་དང་། རང་དབང་དང་། རང་བྱུང་གི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘The generosity of relinquishing male and female slaves, staff, and workers represents the perfection of the bodhisattvas’ freedom, independence, and self-arisen wisdom.

source: བདག་གིས་བྲན་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: Therefore, I will definitely practice generosity by relinquishing male and female slaves, staff, and workers!’

source: དེ་བྲན་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བའི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by relinquishing male and female slaves, staff, and workers,

source: དེ་བཞིན་གཤེགས་པས་གསུངས་ཤིང་བསྟན་པའི་སྨོན་ལམ་བཞིན་དུ་བྲན་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་འདིས་ན། བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རང་དགའ་དང་། རང་དབང་དང་། རང་བྱུང་གི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་གྱུར་ཅིག་
en: ‘In accordance with the aspirations expressed and taught by the thus-gone ones, through this generosity of relinquishing my male and female slaves, staff, and workers may I cause all beings to perfect their freedom, independence, and self-arisen wisdom!’

source: བྲན་དང་བྲན་མོ་བཏང་བ་ཡིས། །མདོར་ན་ལུས་ཅན་ཐམས་ཅད་ཀྱི། །རང་བྱུང་གི་ནི་ཡེ་ཤེས་ཀྱི། །སྙིང་པོ་ཡོངས་སུ་རྫོགས་གྱུར་ཅིག །
en: “In short, by relinquishing my male and female slaves, May all beings Perfect the essence Of their self-arisen wisdom!

source: བྲན་དང་བྲན་མོ་བཏང་བ་ཡིས། །མི་ནི་བྲན་དུ་མི་སྐྱེ་ཞིང་། །བརྟན་པོ་རང་དབང་ཡོད་པས་འཚོ། །ཞུམ་པ་མེད་ཅིང་འཇིགས་པ་མེད། །
en: “Those who relinquish male and female servants Will never be reborn as servants. They will live with security and independence, Never feeling disheartened or afraid.

source: དེ་ལ་གསེར་དང་། དངུལ་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན
en: “How do bodhisattvas exert themselves in the practice of generosity by giving away gold, silver, jewels, pearls, beryls, conch shells, moonstones, coral, and other precious substances?

source: གསེར་དང་། དངུལ་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་ཞེས་བྱ་བ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མཐའ་ཡས་མུ་མེད་པ་དག་ཏུ་འོད་ཟེར་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཀ་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་སྣང་བར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Giving away gold, silver, jewels, pearls, beryls, conch shells, moonstones, coral, and other precious substances represents the blue, yellow, red, white, crimson, crystalline, and silvery colors of the bodhisattvas’ light rays that shine within the infinite myriad buddha realms.

source: བདག་གིས་གསེར་དང་། དངུལ་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: Therefore, I will definitely practice generosity by giving away gold, silver, jewels, pearls, beryls, conch shells, moonstones, coral, and other precious substances!’

source: གསེར་དང་། དངུལ་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by giving away gold, silver, jewels, pearls, beryls, conch shells, moonstones, coral, and other precious substances,

source: དེ་བཞིན་གཤེགས་པས་ཇི་ལྟར་མཁྱེན་ཅིང་བཤད་དེ་གསལ་བར་མཛད་པའི་སྨོན་ལམ་བཞིན་དུ་གསེར་དང་། དངུལ་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་བྱིན་པ་དེས་ན་བདག་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་མཐའ་ཡས་མུ་མེད་པ་དག་ཏུ་འོད་ཟེར་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཀ་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུས་སྣང་བར་བྱེད་པར་གྱུར་ཅིག་
en: ‘In accordance with the aspirations that are known, explained, and clarified by the thus-gone ones, may this offering of gold, silver, jewels, pearls, beryls, conch shells, moonstones, coral, and other precious substances enable me to illuminate infinite myriad buddha realms with blue, yellow, red, white, crimson, crystalline, and silvery light rays!’

source: རིན་ཆེན་བྱིན་པ་དེས་ན་བདག །འོད་ཟེར་སྣ་ཚོགས་སྣང་བ་ཡིས། །སངས་རྒྱས་དྲང་སྲོང་ཆེ་རྣམས་ཀྱི། །ཞིང་རྣམས་ཐམས་ཅད་སྣང་བྱེད་ཤོག །
en: “Through this offering of precious substances, May I illuminate all the fields Of the buddhas, the great sages, With the brilliance of various light rays!

source: རིན་ཆེན་སྣ་ཚོགས་བྱིན་པ་ཡིས། །ངེས་པ་གང་དང་གར་སྐྱེས་པ། །འཇིག་རྟེན་མཚམས་མེད་ཡན་ཅད་དུ། །དེས་ནི་འོད་ཟེར་སྣང་བར་བྱེད། །
en: “The noble persons who offer precious substances Wherever they are reborn, Will illuminate with their light rays All worlds down to the Hell of Endless Torment.

source: དེ་ལ་རྟ་དང་། གླང་པོ་ཆེ་དང་། ཤིང་རྟའི་བཞོན་པ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by giving away vehicles such as horses, elephants, and chariots?

source: རྟ་དང་། གླང་པོ་ཆེ་དང་། ཤིང་རྟའི་བཞོན་པ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་དང་། ཐེག་པ་མཆོག་དང་། ཐེག་པ་མི་མཉམ་པ་དང་མཉམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཐེག་པ་བླ་ན་མེད་པ། གཙོ་བོ་དམ་པ་རབ་མཆོག་སྡུད་པའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Giving away vehicles such as horses, elephants, and chariots represents becoming included within the bodhisattvas’ Great Vehicle—the supreme vehicle, the unequaled vehicle, the unsurpassed buddha vehicle that is the foremost, sublime, and most excellent vehicle. Therefore,

source: བདག་གིས་རྟ་དང་། གླང་པོ་ཆེ་དང་། ཤིང་རྟའི་བཞོན་པ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by giving away horses, elephants, and chariots!’

source: དེ་རྟ་དང་། གླང་པོ་ཆེ་དང་། ཤིང་རྟའི་བཞོན་པ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་སྦྱིན་པ་ན་
en: When practicing generosity by giving away horses, elephants, and chariots,

source: དེ་བཞིན་གཤེགས་པས་གསུངས་ཤིང་བསྒོམས་པའི་སྨོན་ལམ་བཞིན་དུ་རྟ་དང་། གླང་པོ་ཆེ་དང་། ཤིང་རྟའི་བཞོན་པ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་འདིས་ན་
en: ‘In accordance with the aspirations expressed and practiced by the thus-gone ones, by giving away horses, elephants, and chariots

source: བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཐེག་པ་ཆེན་པོ་དང་། ཐེག་པ་མཆོག་དང་། ཐེག་པ་མི་མཉམ་པ་དང་མཉམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཐེག་པ་བླ་ན་མེད་པ། གཙོ་བོ་དམ་པ། རབ་མཆོག་གིས་སྡུད་པར་བྱེད་པར་གྱུར་ཅིག་
en: may I include all beings in the Great Vehicle—the supreme vehicle, the unequaled vehicle, the unsurpassed buddha vehicle that is the foremost, sublime, and most excellent vehicle!’

source: བདག་གིས་གླང་ཆེན་བྱིན་པ་ཡིས། །སངས་རྒྱས་ཐེག་པ་ཐེག་པ་ཆེ། །ཐེག་པ་མཆོག་གིས་ལུས་ཅན་རྣམས། །མྱུར་དུ་སྡུད་པར་བྱེད་པར་ཤོག །
en: “Through this offering of elephants, May I swiftly attract all beings By means of the Great Vehicle of the buddhas— The supreme vehicle!

source: གླང་ཆེན་བྱིན་ཞིང་རྟ་བྱིན་པས། །གསལ་ཞིང་མཁས་ལ་ཤེས་ཉེན་ཅན། །ཐེག་པ་ཆེ་ལ་མོས་པ་དང་། །མི་དེ་སྐལ་བ་ཅན་དུ་འགྱུར། །
en: “Those who offer elephants and horses Will be bright, learned, and intelligent. Being dedicated to the Great Vehicle, Such beings will be fortunate.

source: དེ་ལ་སྐྱེད་མོས་ཚལ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དང་། གཙུག་ལག་ཁང་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by giving away parks, forests for ascetic practice, and temples?

source: སྐྱེད་མོས་ཚལ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དང་། གཙུག་ལག་ཁང་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་གྱི་ཡན་ལག་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Giving away parks, forests for ascetic practice, and temples represents the perfection of the bodhisattvas’ factors of concentration. Therefore,

source: བདག་གིས་སྐྱེད་མོས་ཚལ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དང་། གཙུག་ལག་ཁང་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by giving away parks, forests for ascetic practice, and temples!’

source: དེ་སྐྱེད་མོས་ཚལ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དང་། གཙུག་ལག་ཁང་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་སྦྱིན་པ་ན།
en: When practicing generosity by giving away parks, forests for ascetic practice, and temples,

source: སངས་རྒྱས་ཀྱིས་བསྟོད་ཅིང་བསྔགས་པའི་སྨོན་ལམ་བཞིན་དུ། སྐྱེད་མོས་ཚལ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དང་། གཙུག་ལག་ཁང་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་འདིས་ན་བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་གཏན་གྱི་ཡན་ལག་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་འདེབས་སོ། །
en: bodhisattvas make the following aspiration: ‘In accordance with the aspirations extolled and praised by the buddhas, through this gift of parks, forests for ascetic practice, and temples may I cause all beings to perfect the factors of concentration!’

source: ལྷ་གང་སྐྱེད་མོས་ཚལ་བྱིན་པས། །བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །བསམ་གཏན་ཡན་ལག་རིམ་བཞིན་དུ། །ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་ཤོག །ལྷ་གང་སྐྱེད་མོས་ཚལ་བྱིན་པས། །རྣལ་འབྱོར་ཅན་གྱི་མི་དེ་ནི། །བསམ་གཏན་ཡན་ལག་ཡོངས་རྫོགས་ཤིང་། །རྣལ་འབྱོར་སྤྱོད་ལ་དཀའ་ཐུབ་ཆེ། །
en: “Through this offering of temples and parks, May I cause all beings To gradually perfect The factors of concentration! “The practitioner who offers Temples and parks Will perfect the factors of concentration And practice the spiritual life with great austerity.

source: དེ་ལ་ཆུང་མ་དང་བུ་དང་། བུ་མོ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by giving away their spouses, sons, and daughters?

source: ཆུང་མ་དང་བུ་དང་། བུ་མོ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས་བདག་གིས་ཆུང་མ་དང་། བུ་དང་། བུ་མོ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: ‘Giving away one’s spouses, sons, and daughters represents the bodhisattvas’ awakening to unsurpassed and perfect buddhahood. Therefore, I will definitely practice generosity by giving away my spouses, sons, and daughters!’

source: དེ་ཆུང་མ་དང་། བུ་དང་། བུ་མོ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by giving away their spouses, sons, and daughters,

source: དེ་བཞིན་གཤེགས་པས་བསྙེན་བཀུར་མཛད་མཛད་པའི་སྨོན་ལམ་བཞིན་དུ་ཆུང་མ་དང་། བུ་དང་། བུ་མོ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་འདིས་ན་བདག་སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱེད་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་འདེབས་སོ། །
en: bodhisattvas make the following aspiration: ‘In accordance with the aspirations revered by the thus-gone ones, through this gift of my spouses, sons, and daughters may I cause all beings to fully awaken to unsurpassed and perfect buddhahood!’

source: བུ་ཡི་སྦྱིན་པ་དེས་ན་མྱུར་བར་ཡང་། །སེམས་ཅན་རྣམས་ནི་རེ་རེའི་དོན་གྱི་ཕྱིར། །སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡི། །བྱང་ཆུབ་དམ་པ་འཚང་རྒྱ་བྱེད་པར་ཤོག །
en: “For the sake of every single being, May the offering of my sons Cause all to swiftly awaken To unsurpassed and sacred buddhahood!

source: ཆུང་མ་བུ་དང་བུ་མོ་གཏོང་བྱེད་པ། །དེ་ལ་བྱང་ཆུབ་ཟག་མེད་དགའ་བ་མེད། །
en: “Those who give away their spouses, sons, and daughters Will attain stainless awakening without difficulty.

source: བརྩོན་འགྲུས་ལྡན་པའི་མི་ནི་གང་ལ་ཡང་། །དཀའ་བ་ཅི་ཡང་མེད་པར་བལྟ་བར་བྱ། །
en: Know that such diligent people Will never meet with hardship.

source: དེ་ལ་ནོར་དང་། འབྲུ་དང་། བང་མཛོད་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by giving away wealth, grains, and stores?

source: ནོར་དང་། འབྲུ་དང་། བང་མཛོད་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དམ་པའི་ཆོས་ཀྱི་མཛོད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Giving away wealth, grains, and stores represents the bodhisattvas’ filling of the treasury of the sacred Dharma. Therefore,

source: བདག་གིས་ནོར་དང་། འབྲུ་དང་། བང་མཛོད་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by giving away wealth, grains, and stores!’

source: དེ་ནོར་དང་། འབྲུ་དང་། བང་མཛོད་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by giving away wealth, grains, and stores,

source: དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སྨོན་ལམ་བཞིན་དུ་ནོར་དང་། འབྲུ་དང་། བང་མཛོད་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་འདིས་ན།
en: ‘In accordance with the aspirations expressed by the thus-gone ones, through this gift of wealth, grains, and stores

source: བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དམ་པའི་ཆོས་ཀྱི་མཛོད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་གྱུར་ཅིག་
en: may I cause all beings to perfect the treasury of the sacred Dharma!’

source: ནོར་དང་དབྱིག་རྣམས་གཏོང་བའི་བསོད་ནམས་ནི། །མཁའ་ལས་ལྷག་པ་བདག་ལ་ཅི་ཡོད་པས། །མི་རྣམས་རྒྱུད་ནི་དམ་པའི་ཆོས་མཛོད་ཀྱིས། །རྒྱལ་པོའི་མཛོད་ལྟར་མྱུར་དུ་རྒྱས་གྱུར་ཅིག །
en: “May all the merit, vaster than space, That I have generated by relinquishing wealth and jewels Cause the minds of all beings to swiftly expand, like royal treasuries, By the treasure of the sacred Dharma!

source: ནོར་དང་འབྲུ་དང་བང་མཛོད་བུད་མེད་རྣམས། །གཏོང་བའི་བསོད་ནམས་བདག་ལ་ཅི་ཡོད་པ། །དེས་ན་བདག་གིས་བྱང་ཆུབ་མྱུར་འཐོབ་ཅིང་། །དམ་པའི་ཆོས་ཀྱི་མཛོད་ནི་ཐོབ་པར་ཤོག །
en: “Through whatever merit I have accumulated By giving away wealth, grains, stores, and women, May I swiftly attain awakening And acquire the treasure of the sacred Dharma!

source: དེ་ལ་གླིང་བཞི་དང་། འཛམ་བུའི་གླིང་དང་། རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by relinquishing sovereignty over the four continents and Jambudvīpa, as well as its kingdoms?

source: གླིང་བཞི་དང་། འཛམ་བུའི་གླིང་དང་། རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དམ་པའི་ཆོས་ཀྱི་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་འཐོབ་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Relinquishing sovereignty over the four continents and Jambudvīpa, as well as its kingdoms, represents the bodhisattvas’ achievement of sovereignty over the kingdom of the sacred Dharma. Therefore,

source: བདག་གིས་གླིང་བཞི་དང་། འཛམ་བུའི་གླིང་དང་། རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by relinquishing sovereignty over the four continents and Jambudvīpa, as well as its kingdoms!’

source: དེ་གླིང་བཞི་དང་། འཛམ་བུའི་གླིང་དང་། རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by relinquishing sovereignty over the four continents and Jambudvīpa, as well as its kingdoms,

source: དེ་བཞིན་གཤེགས་པས་བསྟན་པའི་སྨོན་ལམ་བཞིན་དུ། གླིང་བཞི་དང་། འཛམ་བུའི་གླིང་དང་། རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་འདིས་ན།
en: ‘In accordance with the aspirations taught by the thus-gone ones, through this gift of relinquishing sovereignty over the four continents and Jambudvīpa, as well as its kingdoms,

source: བདག་སེམས་ཅན་ཐམས་ཅད་དམ་པའི་ཆོས་ཀྱི་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་འཐོབ་པ་ཐོབ་པར་གྱུར་ཅིག་
en: may I cause all beings to achieve sovereignty over the kingdom of the sacred Dharma!’

source: གླིང་བཞི་རིལ་གྱིས་བཏང་བ་འདི་དག་ལས། །བདག་གིས་བསོད་ནམས་ཅུང་ཟད་ཅི་བསྒྲུབས་པ། །དེས་ན་མི་རྣམས་འདི་དག་དམ་ཆོས་ཀྱི། །རྒྱལ་སྲིད་འཐོབ་པའི་མཐའ་ནི་ཐོབ་གྱུར་ཅིག །
en: “Through whatever merit I have generated By giving away the entirety of the four continents, May all people Obtain the kingdom of the sacred Dharma!

source: འཛམ་བུ་གླིང་ནི་བྱིན་པ་ཡིས། །རིན་ཆེན་སྣ་བདུན་ལྡན་པ་ཡི། །རྒྱལ་པོ་གླིང་བཞི་དབང་བྱེད་པ། །དབང་ཕྱུག་རྣམ་པར་རྒྱལ་བར་འགྱུར། །
en: “Those who offer Jambudvīpa Will become triumphant rulers, Kings who rule the four continents In possession of the seven precious things.

source: དེ་ལ་གཙུག་གི་ནོར་བུ་དང་། ཅོད་པན་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by giving away crest jewels and crowns?

source: གཙུག་གི་ནོར་བུ་དང་། ཅོད་པན་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱི་གཙུག་བལྟར་མི་མཐོང་བར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Giving away crest jewels and crowns represents the bodhisattvas’ achievement of the unseen crown of the head. Therefore,

source: བདག་གིས་གཙུག་གི་ནོར་བུ་དང་། ཅོད་པན་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by giving away crest jewels and crowns!’

source: དེ་གཙུག་གི་ནོར་བུ་དང་། ཅོད་པན་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by giving away crest jewels and crowns,

source: དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སྨོན་ལམ་བཞིན་དུ། གཙུག་གི་ནོར་བུ་དང་། ཅོད་པན་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་འདིས་ན་བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་སྤྱི་གཙུག་བལྟར་མི་མཐོང་བ་ཐོབ་པར་བྱེད་པར་གྱུར་ཅིག་
en: ‘In accordance with the aspirations expressed by the thus-gone ones, may this gift of crest jewels and crowns cause all beings to achieve the unseen crown of the head!’

source: མགོ་བོའི་ནོར་བུ་ཅོད་པན་བྱིན་པ་ཡི། །བསོད་ནམས་ཚོགས་ནི་བདག་ལ་ཅི་ཡོད་པ། །དེས་ན་འདིར་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །སྤྱི་གཙུག་བལྟར་མེད་རྟག་ཏུ་ཐོབ་གྱུར་ཅིག །
en: “Through all the merit I have accumulated By offering crest jewels and crowns, May all beings forever achieve The unseen crown of the head!

source: གཙུག་གི་ནོར་བུ་བྱིན་དེས་བདག །ནྱ་གྲོ་ད་ལྟར་ཆུ་ཞེང་གབ། །གསེར་དང་ནོར་བུ་བྱས་པ་ཡིས། །གཙུག་ཏོར་ཕུན་སུམ་ཚོགས་པར་ཤོག །
en: “Through the offering of crest jewels, May I achieve the excellent crown protuberance, Which is wide like a fig tree And made of gold and jewels!

source: དེ་ལ་རྐང་པ་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering their feet?

source: རྐང་པ་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཀྱི་རྐང་པ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Offering one’s feet represents the bodhisattvas’ Dharma feet that lead to the seat of awakening. Therefore,

source: བདག་གིས་རྐང་པ་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by offering my feet!’

source: དེ་ལ་རྐང་པ་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering their feet,

source: དེ་བཞིན་གཤེགས་པས་བརྙེས་པའི་སྨོན་ལམ་བཞིན་དུ་རྐང་པ་སྦྱིན་པ་འདིས་ན།
en: ‘In accordance with the aspirations accomplished by the thus-gone ones, through this offering of my feet

source: མི་རྣམས་དང་སེམས་ཅན་ཐམས་ཅད་རྟག་ཏུ་མྱུར་བར་ཁྱིམ་ནས་མངོན་པར་བྱུང་ནས་
en: may all humans and other beings quickly renounce their households forever and,

source: སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བའི་གནོད་པ་ཞི་བར་བྱ་བའི་དོན་གྱི་ཕྱིར་འདོད་བཞིན་དུ་བག་བརྐྱང་ནས་རབ་ཏུ་དགའ་ཞིང་དབང་པོ་ཞི་ལ་སྐྱབས་སུ་
en: in order to pacify the harm associated with birth, old age, sickness, and death, become purposefully restrained and joyful, their senses controlled.

source: འོས་པའི་ཟླ་བའི་འོད་ལྟར་གཟུགས་ཞི་བ་སྣང་བྱེད་
en: Like the gentle moonlight, may their appearance become peaceful and radiant.

source: ཉི་མ་སྣ་ཚོགས་ཀྱི་གཟི་བརྗིད་ལྟར་སྙིང་རྗེ་ལས་བྱུང་བའི་འོད་ཟེར་འཕྲོ་བས་མཚམས་མེད་པ་ཡན་ཅད་མུན་པར་ཞུགས་པས་ཉམ་ཐག་པའི་མི་རྣམས་ཀྱི་མུན་པ་སྣང་བར་བྱས་ནས་ལུས་རབ་ཏུ་ཚ་བའི་སྡུག་བསྔལ་རྣམས་སེལ་ཅིང་
en: Like the brilliance of many suns, may the light rays of their compassion illuminate the gloom of helpless humans engulfed in darkness, down to the Hell of Endless Torment, and eliminate the physical sufferings of extreme heat. May they be endowed with lotus-like feet, which are adorned with the marks of thousand-spoked wheels, even, and smooth.

source: པད་མའི་རྐང་པ་འཁོར་ལོ་རྩིབས་སྟོང་དང་ལྡན་པའི་མཚན་གྱིས་སྤྲས་ལ། མཉམ་ཞིང་འཇམ་པ་དང་། སོར་མོ་རིང་ཞིང་ངང་པའི་རྐང་པ་ལྟར་དྲ་བས་འབྲེལ་པ་དང་། སེན་མོ་མེ་ལོང་བཟང་པོ་དག་པར་ཕྱིས་པ་ལྟ་བུས་བརྒྱན་ཏེ
en: May they obtain long toes connected by webbing like the feet of swans, and may they have nails that are beautiful like fine and polished mirrors.

source: མེ་ཏོག་ཀུན་ད་ལྟར་འདུག་པ་དང་། ལོང་བུ་མི་མངོན་པ་དང་། རྗེ་ངར་སྨྱིག་མ་དང་རི་དགས་ཨེ་ན་ཡའི་བྱིན་པ་འདྲ་བའི་ཡ་མཚན་གྱི་སྟབས་ཀྱིས་དལ་བུས་དལ་ནས་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་གདན་རྡོ་རྗེའི་སྟེགས་བུའི་གདན།
en: May their feet be like jasmine flowers. May they have anklebones that do not protrude, and calf bones similar to reeds or the calves of antelopes. With such features on their feet, may they gently and leisurely proceed to the vajra throne at the seat of awakening.

source: ཆོས་ཀྱི་སེང་གེའི་ཁྲི་ལ་བདུད་རྣམ་པར་གཞོམ་པའི་ཕྱིར་ཤིན་ཏུ་གནོན་པར་གྱུར་ཅིག་
en: There, on the lion throne of the Dharma, may they thoroughly trample on Māra in order to overcome him!’

source: རྐང་པ་བྱིན་པ་འདི་ཡིས་ན། །
en: “Through this offering of my feet,

source: རྐང་ཐིལ་འཁོར་ལོའི་མཚན་ཅན་གྱིས། །བྱང་ཆུབ་སྙིང་པོའི་གདན་བཟངས་ལ། །བརྟན་པོས་ཤིན་ཏུ་གནོན་པར་ཤོག །
en: May the soles of others’ feet, marked by wheels, Step firmly on the excellent throne At the seat of awakening!

source: རྐང་པ་སྦྱིན་པ་འདིས་ན་བདག །བྱང་ཆུབ་སྙིང་པོའི་གདན་མཆོག་ལ། །འདུག་ནས་བདུད་རྣམས་སྡེ་དང་དཔུང་། །བཞོན་དང་བཅས་པར་འདུལ་བར་ཤོག །
en: “Through this offering of my feet, May I ascend the supreme throne at the seat of awakening, And defeat the demonic armies and troops, As well as their vehicles!

source: དེ་ལ་ལག་མཐིལ་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering their hands?
